Revit 2026 API

# SpacingRuleJustification Enumeration

---

Justification property of spacing rule

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum SpacingRuleJustification
```
```vb
Public Enumeration SpacingRuleJustification
```
```cpp
public enum class SpacingRuleJustification
```
```fsharp
type SpacingRuleJustification
```

| Member name | Value | Description |
| --- | --- | --- |
| Beginning | 4 |  |
| Center | 2 |  |
| End | 5 |  |

#### Reference

Autodesk.Revit.DB Namespace